performance-test-reports/automated-security-tests/12609157934/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2025-01-04T09:03:33Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  98% — ✓ 337157 / ✗ 6665
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 2094
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1391
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3180

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 337157 / ✗ 6665
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 337157 / ✗ 6665
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6665    7.577418/s
-    _response_success_cnt..........: 337157  383.312777/s
-    _response_total_cnt............: 343822  390.890195/s
-    checks.........................: 99.34%  ✓ 4072544     ✗ 26660 
-    data_received..................: 121 MB  137 kB/s
-    data_sent......................: 81 MB   92 kB/s
-    dropped_iterations.............: 1618207 1839.734659/s
-    group_duration.................: avg=893.6ms  min=237.17µs med=2.28ms   max=1m0s    p(90)=1.26s    p(95)=2.49s   
-    http_req_blocked...............: avg=465.81ms min=0s       med=171.09µs max=19.59s  p(90)=1.02s    p(95)=2.05s   
-    http_req_connecting............: avg=465.77ms min=0s       med=132.28µs max=19.59s  p(90)=1.02s    p(95)=2.05s   
-  ✗ http_req_duration..............: avg=1.19s    min=0s       med=244.75ms max=59.01s  p(90)=740.96ms p(95)=1.5s    
-      { expected_response:true }...: avg=525.51ms min=841.22µs med=244.42ms max=58.79s  p(90)=646.47ms p(95)=1.2s    
-  ✗ http_req_failed................: 1.93%   ✓ 6665        ✗ 337157
-    http_req_receiving.............: avg=401.91µs min=0s       med=76.02µs  max=54.31ms p(90)=991.48µs p(95)=1.78ms  
-    http_req_sending...............: avg=137.48µs min=0s       med=32.68µs  max=59.83ms p(90)=142.38µs p(95)=261.74µs
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.19s    min=0s       med=244.21ms max=59.01s  p(90)=739.9ms  p(95)=1.5s    
-    http_reqs......................: 343822  390.890195/s
-    iteration_duration.............: avg=1.78s    min=3.06ms   med=251.67ms max=1m0s    p(90)=2.49s    p(95)=5.33s   
-    iterations.....................: 343822  390.890195/s
-    vus............................: 2       min=0         max=1000
-    vus_max........................: 1000    min=390       max=1000